Revit 2027 API
SpatialElementTag.LeaderStart Property
 The leader start point for tags that use leader start condition Free.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ LeaderStart { get; set; }
Public Property LeaderStart As XYZ
	Get
	Set
public:
property XYZ^ LeaderStart {
	XYZ^ get ();
	void set (XYZ^ value);
}
member LeaderStart : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  There is no leader for this tag. -or- When setting this property: SpatialElementTag is pinned. -or- When setting this property: SpatialElementTag is orphaned.
Remarks
 The leader start point is the leader point closest to the tag head. Use LeaderStartCondition to get the leader start condition of the tag.
See Also
Reference
SpatialElementTag Class
Autodesk.Revit.DB Namespace